Documents/БольничныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>БольничныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчётЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПредприятия</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.День</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

AccumulationRegisters/УчётЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>УчётЗатрат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Работает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/БольничныйЛист/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)    
    Движения.Начисления.Записывать        = Истина;
    Движения.УчётЗатрат.Записывать        = Истина;
    Движения.Хозрасчетный.Записывать    = Истина;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад
    |ИЗ
    |    РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Период, ) КАК КадроваяИсторияСотрудниковСрезПоследних
    |ГДЕ
    |    КадроваяИсторияСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
    Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаОкончания);
    Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Сотрудник);
    
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        ПараметрРасчета = 0;
    Иначе
        ПараметрРасчета = Запрос.Выполнить().Выгрузить()[0].Оклад;
    КонецЕсли;
    
    МесяцНачаисления = НачалоМесяца(ЭтотОбъект.ДатаНачала);
    МесяцОкончания     = НачалоМесяца(ЭтотОбъект.ДатаОкончания);
    //Регистр "Начисления"
    Пока МесяцНачаисления <= МесяцОкончания Цикл
        Движение = Движения.Начисления.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета             = ПланыВидовРасчета.Начисления.Больничный;
        Движение.ПериодДействияНачало    = Макс(ЭтотОбъект.ДатаНачала, МесяцНачаисления);
        Движение.ПериодДействияКонец     = Мин(ЭтотОбъект.ДатаОкончания, КонецМесяца(МесяцНачаисления));
        Движение.ПериодРегистрации         = ЭтотОбъект.ПериодНачисления;
        Движение.БазовыйПериодНачало     = Макс(ЭтотОбъект.ДатаНачала, МесяцНачаисления);
        Движение.БазовыйПериодКонец     = Мин(ЭтотОбъект.ДатаОкончания, КонецМесяца(МесяцНачаисления));
        Движение.Сотрудник                 = Сотрудник;
        Движение.ПоказательРасчета        = ПараметрРасчета;
        
        МесяцНачаисления = ДобавитьМесяц(МесяцНачаисления, 1);    
    КонецЦикла;
    
    Движения.Начисления.Записать();
    Движения.Начисления.РассчитатьСуммуНачисления();
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Начисления.Сотрудник КАК Сотрудник,
    |    СУММА(Начисления.Сумма) КАК Сумма,
    |    Начисления.ВидРасчета.СтатьяЗатрат КАК СтатьяЗатрат
    |ИЗ
    |    РегистрРасчета.Начисления КАК Начисления
    |ГДЕ
    |    Начисления.Регистратор = &Регистратор
    |
    |СГРУППИРОВАТЬ ПО
    |    Начисления.Сотрудник,
    |    Начисления.ВидРасчета.СтатьяЗатрат";
    
    Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
    
    //Регистр "Учет затрат"    
    ДвижениеЗатрат = Движения.УчётЗатрат.Добавить();
    ДвижениеЗатрат.Период        = Дата;
    ДвижениеЗатрат.Сумма        = Выборка.Сумма;
    ДвижениеЗатрат.СтатьяЗатрат    = Выборка.СтатьяЗатрат;    
    // Регистр "Хозрасчетный"     
    ДвижениеХозрасчетный = Движения.Хозрасчетный.Добавить();
    ДвижениеХозрасчетный.СчетДт        = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;     
    ДвижениеХозрасчетный.СчетКт        = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
    ДвижениеХозрасчетный.Период        = Дата;        
    ДвижениеХозрасчетный.Сумма        = Выборка.Сумма;        
    ДвижениеХозрасчетный.Содержание    = "Отражено начисление по больничному листу";
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетДт, 
                    ДвижениеХозрасчетный.СубконтоДт, Выборка.СтатьяЗатрат);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетКт, 
                        ДвижениеХозрасчетный.СубконтоКт, Выборка.Сотрудник);
    
КонецПроцедуры
